{
    "i18n": {
        "shared": {
            "navbar": {
                "home": "Home",
                "developer": "Developer",
                "researcher": "Researcher",
                "showOtherLanguage" : "Em português"
            },
            "footer": {
                "title": "R. Eiki - 2022",
                "github": "GitHub",
                "linkedin": "LinkedIn"
            },
            "grid-media": {
                "more": "See more"
            }
        },

        "/": {
            "name": "Rafael Eiki",
            "developer": "Full-Stack Software Engineer",
            "researcher": "EdTech Researcher",
            "entrepreneur": "Entrepreneur",
            "footer": "R. Eiki - 2022",
            "main-image-alt": "Picture of Rafael Eiki"
        },

        "/developer": {
            "title": "Full-Stack Software Engineer",

            "experiences": {
                "title": "Experiences",

                "liftventures": {
                    "title": "Senior Software Engineer",
                    "company": "Lift Ventures",
                    "time": "Jan/2022-Present",
                    "description": "Full-Stack Developer, working with Ruby on Rails and React."
                },

                "quintoandar": {
                    "title": "Software Engineer III",
                    "company": "QuintoAndar",
                    "time": "Apr/2021-Dec/2021",
                    "description": "Full-Stack Developer, working with Java (Spring, Hibernate) and React."
                },

                "vivros": {
                    "title": "Co-founder",
                    "company": "Vivros",
                    "time": "Jan/2018-Mar/2021",
                    "description": "Co-founder at Vivros, a startup that sells books that are interactive on the paper and in the app. Responsible by business, and was part of the development team of the website (Ruby on Rails, React) and the Android app (Java, Kotlin)."
                },

                "microsoft": {
                    "title": "Software Engineer Intern",
                    "company": "Microsoft",
                    "time": "Dec/2018-Mar/2019",
                    "description": "Internship at the Business Application Group developing a feature to help partner publishers and clients of Dynamics 365 in a complex back-end structure using C#."
                },

                "cientistabeta": {
                    "cientistabeta.title": "Tech Lead - Full-stack",
                    "cientistabeta.company": "Instituto Cientista Beta",
                    "cientistabeta.time": "Feb/2018-Dec/2018",
                    "cientistabeta.description": "Development of virtual platforms \"Decola Beta\" and \"Mapa das Feiras\", impacting the NGOs programs with over 100 children and teenagers, mentors and partners. Leadership of a team with 3 engineers. The projects were developed using Ruby on Rails and JavaScript."
                },

                "unicamp": {
                    "unicamp.title": "R&D - Undergraduate Researcher",
                    "unicamp.company": "Unicamp",
                    "unicamp.time": "Nov/2016-Jun/2019",
                    "unicamp.description": "Besides the research responsibilities, I was a developer (mostly web, JavaScript, AR.js) of technologies to support my research and others of the LInterHAD Research Lab."
                },

                "playkids-ft": {
                    "title": "Jr. Full-Stack Developer",
                    "company": "PlayKids (Movile)",
                    "time": "Nov/2015-Jun/2016",
                    "description": "Development of the CMS of PlayKids, an app with 6 million active users per month in over 25 countries. Technologies: Ruby on Rails, jQuery, Spring (Java)."
                },

                "playkids-intern": {
                    "title": "Software Engineer Intern",
                    "company": "PlayKids (Movile)",
                    "time": "Jan/2015-Out/2015",
                    "description": "Development of the CMS of PlayKids, an app with 6 million active users per month in over 25 countries. Technologies: Ruby on Rails, jQuery, Spring (Java)."
                }
            },
            "education": {
                "title": "Education",

                "ed-unicamp": {
                    "title": "Bachelor of Computer Science",
                    "company": "UNICAMP",
                    "time": "Feb/2015-Dec/2019",
                    "description": "Bachelor of Computer Science, certifier in Information Systems, graduated at the State University of Campinas (UNICAMP) em 2019. Researh focus in Human-Computer Interaction and EdTech, advisored by Cecília Baranauskas, global reference in the area. Winner of the \"Best Undergraduate Research 2018\" of the Computing Institute."
                },

                "ed-cotuca": {
                    "title": "Software Development Technician",
                    "company": "COTUCA",
                    "time": "Feb/2012-Nov/2015",
                    "description": "Software Development Technician course, focusing in EdTech in my Course Final Project."
                }
            }
        },

        "/researcher": {
            "title": "EdTech Researcher",

            "papers": {
                "title": "Papers",

                "1": {
                    "title": "A framework for socio-enactive educational systems: linking learning, design, and technology",
                    "conference": "IHC \"19 Proceedings of the 18th Brazilian Symposium on Human Factors in Computing Systems",
                    "time": "Out 2019",
                    "description": "Enactive interfaces are information systems which are guided by action and interaction with the whole body and senses. Enactive systems are a challenging type of system to develop due to the multimodal human-technology coupling. Socio-enactive systems are an extension of this concept, bringing attention to socio-cultural values in the dynamic coupling of human and technology. While socio-enactive systems are promising for learning purposes, different aspects of the environment can impact the development of these systems in an educational context. This paper presents a framework to develop such systems, named Socio-Enactive Educational System Framework (SEES Framework). The framework is based on Human-Computer Interaction and learning theories and is illustrated with a case study conducted with people of different ages. Results of the case study show that the process and use of the framework might be an alternative for the design of collaborative learning tools that allow students to express their individual values, and the framework has the potential to increase the likelihood to implement successfully such systems."
                },

                "2": {
                    "title": "Reading as a Collaborative Construction: supporting the design of physico-virtual environments",
                    "conference": "Nuevas Ideas en Informática Educativa, Volumen 1 - Full paper presented in the International Conference in Educational Informatics 2018",
                    "time": "Nov 2018",
                    "description": "Collaborative reading and hypertext allow readers to have an active role through their points of view and interests in the text. The active interaction in the reading of these texts brings cognitive advantages, since it changes interpretation of its contents. Although we find literature research on this type of reading, we do not find forms of hypertexts created to favor collaborative reading in richer interaction. Thus, this work proposes a framework for the construction of systems with the concept of Collaborative Reading in the Physico-Virtual environment (CRPV). This framework is based on Organizational Semiotics artifacts, the structure of hypertexts and the concept of enaction. In this work, text structures of this model and corresponding multimodal interfaces were created. The CRPV scenarios implement the interactions with contemporary technologies, including augmented reality, seeking to achieve the concept of an enactive and socio-enactive system. One of these scenarios has already been tested and the initial experiment showed engagement and high motivation of participants in the activity. This research has the potential to contribute to the creation of new spaces and reading processes through multimodal interfaces studies, offering highly dynamic interactions in environments that can be built at low cost."
                },

                "3": {
                    "title": "Sistemas socioenativos para leitura colaborativa: construção técnica, pedagógica e de design",
                    "conference": "WTD IC Unicamp",
                    "time": "Nov 2018",
                    "description": "Este artigo aborda a criação de um framework teórico e técnico para desenvolver sistemas socioenativos para educação, com a concepção de um sistema que implementa o conceito de leitura colaborativa com uso de tecnologias contemporâneas em um ambiente Físico-Virtual. Aspectos técnicos computacionais socioenativos e fatores pedagógicos foram envolvidos no processo de design. Em experimentos com diferentes grupos, a experiência de leitura colaborativa foi motivadora, integradora e criativa. Os frameworks criados foram derivados dos experimentos e de artefatos teóricos, trilhando caminhos para novos sistemas interativos usarem a socioenação na educação."
                },

                "4": {
                    "title": "Criando uma experiência de leitura colaborativa de histórias fictícias físico-virtuais com realidade aumentada",
                    "conference": "BRAZILIAN SYMPOSIUM ON COMPUTERS IN EDUCATION (SIMPÓSIO BRASILEIRO DE INFORMÁTICA NA EDUCAÇÃO - SBIE)",
                    "time": "Out 2018",
                    "description": "No contexto de sociedade da informação, as práticas de leitura tornam-se chaves para exercer cidadania. Em textos que geram discussão, essas habilidades são ainda mais necessárias e uma das práticas possíveis para facilitar o debate é a leitura colaborativa. Neste artigo, é apresentado um protótipo inicial para o conceito de Leitura Colaborativa no ambiente Físico-Virtual, levando a leitura colaborativa a uma aplicação web voltada para smartphones com uso de realidade aumentada. A experimentação de um cenário que usa o software foi de grande interesse dos participantes e pode servir como uma nova forma de estruturação de mídia para uso em diferentes contextos."
                }
            },

            "advising": {
                "title": "Advisors",

                "unicamp": {
                    "title": "Maria C. C. Baranauskas",
                    "subtitle": "UNICAMP - State University of Campinas",
                    "time": "2017-2019",
                    "description": "Advisor of my undergraduate research abour Collaborative Reading in the Physico-Virtual environment (CRPV). The project was part of a thematic project by FAPESP about socioenactive systems. The project received a PIBIC scholarship, a FAPESP scholarship, an Alumni scholarship by the Computing Institute (CI) at UNICAMP, and had 4 papers published 4 artigos and award as Best Undergraduate Research by the CI-UNICAMP in 2018."
                },

                "cotuca": {
                    "title": "Andréia C. Souza, Cristine Megid",
                    "subtitle": "COTUCA - Technical High School of UNICAMP",
                    "time": "2014-2016",
                    "description": "They advisored the project Orientadoras do projeto \"Yarner: Study of Technologies Inside Classrooms Focusing on Literacy with the Development of a Digital Web and Mobile Application\". The project received over 20 awards in science fairs in Brazil and the USA, including awards given by organizations such as Intel, 3M, Organization of American States, Oracle, and GoDaddy."
                }
            },

            "initiatives": {
                "title": "Initiatives",

                "febrace": {
                    "title": "Moderator for the STEM category",
                    "subtitle": "FEBRACE",
                    "time": "2021",
                    "description": "Moderator of the finalists\" presentations at the National Brazilian Science and Engineering Fair, being member of the organization of one of the biggest science fairs in Brazil."
                },

                "devy": {
                    "title": "Creator & Coordinator of the program",
                    "subtitle": "DevY",
                    "time": "2017-2019",
                    "description": "Mentorship program to advise young researchers. Classes of 2017 and 2018 had 12 projects in total. The projects received 20 awards, among them Intel Excelence in Computer Science and 2nd place in the largest science fair in Latin America, Mostratec."
                },

                "cientistabeta": {
                    "title": "Mentor & Developer",
                    "subtitle": "Cientista Beta Institute",
                    "time": "2017-2018",
                    "description": "Mentor in the Decola Beta Program and volunteer developer for the science programs of the NGO"
                },

                "mostracotuca": {
                    "title": "Social Media Manager & Science Fair Judge",
                    "subtitle": "Technical Courses Projects Fair",
                    "time": "2017",
                    "description": "Responsible for comunication in social media for the tecnical-scientific fair."
                }
            }
        }
    }
}
